Revit 2027 API
Application.GetSystemsAnalysisWorkflowNames Method
 Returns names for systems analysis workflows.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetSystemsAnalysisWorkflowNames()
Public Function GetSystemsAnalysisWorkflowNames As IList(Of String)
public:
IList<String^>^ GetSystemsAnalysisWorkflowNames()
member GetSystemsAnalysisWorkflowNames : unit -> IList<string>
Return Value
IList<String>
 An array of names of systems analysis workflows.
Remarks
 The array that is returned contains the name of the systems analysis workflow, in the order they are specified in Options.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace